<p align="center">  МИНИСТЕРСТВО НАУКИ И ВЫСШЕГО ОБРАЗОВАНИЯ РОССИЙСКОЙСКОЙ ФЕДЕРАЦИИ
Федеральное государственное автономное образовательное учреждение высшего образования
 <br/>
 "КРЫМСКИЙ ФЕДЕРАЛЬНЫЙ УНИВЕРСИТЕТ им. В. И. ВЕРНАДСКОГО"  <br/>
  ФИЗИКО-ТЕХНИЧЕСКИЙ ИНСТИТУТ <br/>
    Кафедра компьютерной инженерии и моделирования<br/></p>

<br/>

### <p align="center">Отчёт по лабораторной работе №3 <br/> по дисциплине "Программирование"</p>

<br/>

студента 1 курса группы ИВТ-б-о-191-1

Мусаелян Арины 
        направления подготовки 09.03.01 "Информатика и вычислительная техника"  
<br/>

<table>
<tr><td>Научный руководитель<br/> старший преподаватель кафедры<br/> компьютерной инженерии и моделирования</td>
<td>(оценка)</td>
<td>Чабанов В.В.</td>
</tr>
</table>

<br/><br/>

<p align="center">Симферополь, 2020</p>

**<u>Цель работы</u>**:  закрепить навыки разработки программ использующих операторы цикла; закрепить навыки разработки программ использующих массивы; освоить методы подключения сторонних библиотек.

**<u>Постановка задачи:</u>** написать программу на языке C++, которая по заданному изображению и ключу восстанавливает исходное текстовое сообщение(Си-строка) зашифрованное в изображении.

**<u>Ход работы</u>**

1. Исходное изображение (рис.1)





2. Ключ (рис.2)







3. Код программы:

   ```c++
      #include <iostream>
      #include <cstdlib>
      #include "libbmp.h"
   
      using namespace std;
   
      enum CANAL
      {
      	RED,
      	BLUE,
      	GREEN,
      };
   
      bool get_toChar (BmpImg* img, int x, int y, CANAL canal, int& val, int& count)
      {
      	switch (canal)
      	{
      	case RED:
      		val = val + (img->red_at(x, y) % 2) * pow(2, count);
      		return true;
      	case BLUE:
      		val = val + (img->blue_at(x, y) % 2) * pow(2, count);
      		return true;
      	case GREEN:
      		val = val + (img->green_at(x, y) % 2) * pow(2, count);
      		return true;
      	}
   
      }
   
      bool proverka(int& count, int& val)
      {
      	if (count == 0)
      	{
      		if (char(val) == '\0') return false;
      			cout << char(val);
      			count = 8;
      			val = 0;
      	}
      	return true;
      }
   
      int main()
      {
      	BmpImg img;
      	img.read("pic6.bmp"); // Ключ: 00r 00b 00g 10r 10b 10g 01r 01b
      	int count = 7;
      	int val = 0;
      	for (int j=0 ; j<=img.get_height() - 1; j++)
      	{
      	  for (int i=0 ; i<= img.get_width() - 1; i++)
      	   {
      		if (!(get_toChar(&img, i, j, RED ,val, count) && proverka(count, val)))                      return 0;
      			count--;
      		if (!(get_toChar(&img, i, j,BLUE, val, count) && proverka(count, val)))                      return 0;
      			count--;
      		if (!(get_toChar(&img, i, j,GREEN ,val, count) && proverka(count, val)))                     eturn 0;
      			count--;
      		}
      	}
      }
   
   
   
   
   
   
   ```

   


4. Вывод в консоли:







5. Дешифрованное текстовое сообщение

   John Quincy Adams July 11, 1767 Ц February 23, 1848) was an American statesman, diplomat, lawyer, and diarist who served as the sixth president of the United States from 1825 to 1829. He previously served as the eighth United States Secretary of State from 1817 to 1825. During his long diplomatic and political career, Adams also served as an ambassador, and as a member of the United States Senate and United States House of Representatives representing Massachusetts. He was the eldest son of John Adams, who served as the second US president from 1797 to 1801, and First Lady Abigail Adams. Initially a Federalist like his father, he won election to the presidency as a member of the Democratic-Republican Party, and in the mid-1830s became affiliated with the Whig Party.
   Born in Braintree, Massachusetts, Adams spent much of his youth in Europe, where his father served as a diplomat. After returning to the United States, Adams established a successful legal practice in Boston. In 1794, President George Washington appointed Adams as the U.S. ambassador to the Netherlands, and Adams would serve in high-ranking diplomatic posts until 1801, when Thomas Jefferson took office as president. Federalist leaders in Massachusetts arranged for Adams's election to the United States Senate in 1802, but Adams broke with the Federalist Party over foreign policy and was denied re-election. In 1809, Adams was appointed as the U.S. ambassador to Russia by President James Madison, a member of the Democratic-Republican Party. Adams held diplomatic posts for the duration of Madison's presidency, and he served as part of the American delegation that negotiated an end to the War of 1812. In 1817, newly-elected President James Monroe selected Adams as his Secretary of State. In that role, Adams negotiated the AdamsЦOnэs Treaty, which provided for the American acquisition of Florida. He also helped formulate the Monroe Doctrine, which became a key tenet of U.S. foreign policy.
   The 1824 presidential election was contested by Adams, Andrew Jackson, William H. Crawford, and Henry Clay, all of whom were members of the Democratic-Republican Party. As no candidate won a majority of the electoral vote, the House of Representatives held a contingent election to determine the president, and Adams won that contingent election with the support of Clay. As president, Adams called for an ambitious agenda that included federally-funded infrastructure projects, the establishment of a national university, and engagement with the countries of Latin America, but many of his initiatives were defeated in Congress. During Adams's presidency, the Democratic-Republican Party polarized into two major camps: one group, known as the National Republican Party, supported President Adams, while the other group, known as the Democratic Party, was led by Andrew Jackson. The Democrats proved to be more effective political organizers than Adams and his National Republican supporters, and Jackson decisively defeated Adams in the 1828 presidential election.
   Rather than retiring from public service, Adams won election to the House of Representatives, where he would serve from 1831 to his death in 1848. He joined the Anti-Masonic Party in the early 1830s before becoming a member of the Whig Party, which united those opposed to President Jackson. During his time in Congress, Adams became increasingly critical of slavery and of the Southern leaders whom he believed controlled the Democratic Party. He was particularly opposed to the annexation of Texas and the MexicanЦAmerican War, which he saw as a war to extend slavery. He also led the repeal of the "gag rule," which had prevented the House of Representatives from debating petitions to abolish slavery. Historians generally concur that Adams was one of the greatest diplomats and secretaries of state in American history, but they tend to rank him as an above-average president.

**<u>Вывод:</u>** В ходе лабораторной работы я закрепила навыки разработки программ использующих операторы цикла; закрепила навыки разработки программ использующих массивы; научилась разрабатывать программу для дешифровки текста из изображения. 